# Написать программу в виде оператора цикла с параметром,
# обеспечивающий вывод на экран "столбиком"
# всех целых чисел от 10 до 30.
# Оформить этот фрагмент в виде:
# а. оператора цикла с предусловием
# б. оператора цикла с постусловием.

for i in range(10, 30):
    if 10 <= i <= 30:
        print(i)





